app/Controllers/Auth.php

    public function login(){

        // menyiapkan model
        $userModels = new UserModel();

        // mengambil data dari tampilan login
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        // Cek dan cari username yang ada di tabel user
        $cekUser = $userModels->where('username', $username)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'admin'
 LIMIT 1