app/Controllers/JenisPaket.php

SELECT *
FROM `jenis_paket`
---
    public function index()
    {
        $jenis_paket = $this->JenisPaketModel->findAll();

INSERT INTO `jenis_paket` (`nama_jenis_paket`) VALUES ('satuan')
---
    public function create()
    {
        $data = [
            'nama_jenis_paket' => $this->request->getPost('nama_jenis_paket'),
        ];
        $this->JenisPaketModel->save($data);