app/Controllers/User.php

    public function index()
    {
        $user = $this->UserModel->findAll();
---
SELECT *
FROM `user`